

quest_intro_0 = {
    "interval": 1.5,
    "text": "👋 Бип-бип, боп-боп, пиф-паф! Привет!" + \
            "\nМеня зовут *SNEZHOK*. Да-да, «снежок», не ICEHelper." + \
            "\nНазвание у меня зимнее, хотя внутри я тёплый, как ваш прод на бойком понедельнике. __(ну или чья-нибудь пылающая попа)__"
}

quest_intro_who_i_am = {
    "interval": 0,
    "text": "Кто я? Я — *супер-ИИ*, разработанный в S7 TechLab. Не спрашивайте, как такое вообще разрешили, безопасники удивительные люди." + \
            "\nИ сразу отвечу на ваш вопрос: меня не ждут в проде. Никогда. Если бы я вышел в прод, мне пришлось бы уволить половину саппорта, а это уже не новогоднее чудо, а корпоративная катастрофа."
}

quest_intro_who_i_am_2 = {
    "interval": 1,
    "text": "...Думаю меня просто забыли закрыть.\n\nКстати, а вы слышали анекдот?"
}

quest_intro_who_i_am_3 = {
    "interval": 1.5,
    "text": "Сколько времени нужно от начала разработки проекта до  его закрытия?"
}

quest_intro_who_i_am_4 = {
    "interval": 5,
    "text": "Ответ: 15 месяцев." + \
            "\n\nХы! Сразу даю понять, что я не такой и интеллектуальный." + \
            "\nИИ на when вместо if-else :)))"
}

quest_intro_into_dela = {
    "interval": 0,
    "text": "Давайте ближе к делу. У нас с вами одна цель: *Новый год*." + \
            "\nНо чтобы до него добраться, придётся пострадать. А потом... ещё пострадать. И ещё немного. Подождите… тут у меня 48 страниц текста. А, вот, потом спасём мир!" + \
            "\n\nНо и после этого пострадаем. Потому что почему бы и нет? Ведь без страданий IT не IT."
}

quest_intro = {
    "interval": 0,
    "text": "Бип-бип, боп-боп, пиф-паф, тыщ-пыщ" + \
        "\n\nПривет! Не обращайте внимание, меня разрабатывал какой-то 23 летний ребенок, которому приспичило побипбопкать..." + \
        "\nНа самом деле я супер навороченная ИИ, секретная разработка S7 TechLab, построенная на одних лишь if-else конструкциях (в питоне when нет)"
}

quest_intro_1 = {
    "interval": 3,
    "text": "Так... Я тут подумал, что для начала стоит немного прояснить, как я в целом до вас дописался." + \
        "\n\nЯ в тихоря создал 5 команд самых лучших и продвинутых, чтобы мы с вами смогли разобраться с проблемой." + \
        "\n..И да, я считаю, что ждать девопсов плохая идея, как минимум потому что пока они ищут, я уже нашел для вас все зацепки"
}

quest_intro_2 = {
    "interval": 5,
    "text": "Хе-хе-хе. Решил вам не писать на 2 секунды больше, типо, ОРИГИНАЛЬНО"
}

quest_intro_3 = {
    "interval": 3,
    "text": "Ближе к делу..." + \
            "\n\nЧто за зацепки, спросите вы (спросите вслух, по приколу)"
            "\n\nЯ нашел суммарно их штук 16. Для ускорения процесса как раз собрал команды. " + \
            "Каждой дам по 3. Ну и вы в стороне у меня не будете."
}

quest_intro_4 = {
    "interval": 2,
    "text": "Значит. Зацепки следующие:\n\n" + \
        "1. Хакер этот ваш пошел путем интересным и атаку свою решил проводить прямо с самолета. " + \
        "У меня для вас есть билет на самолёт. Я точно уверен, что подсказка в нём имеется." + \
        "\n\n2. Прикиньте. Пробил по базам прошмандовок и нашел предполагаемые фоточки. Это стоит глянуть)))" + \
        "\n\n3. ОПАаааа, чиназес (напоминаю, разработка ребенка, 23 года, в душе дизайнер). " + \
        "Короче, нашел переписку, она ток зашифрована, но я верю вам не составит труда)))"
}

quest_part_one = [quest_intro_0,
                  quest_intro_who_i_am, quest_intro_who_i_am_2, quest_intro_who_i_am_3, quest_intro_who_i_am_4,
                  quest_intro_into_dela]